Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་།
en: II-III: 41} [How wonderful it is that] through skillful means, they themselves will emanate in the physical form of the buddhas, journey from world system to world system, and be present in places where the lord buddhas have not been born and have not appeared, describing the attributes of the perfection of generosity; describing the attributes of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; describing the attributes of the emptiness of internal phenomena and of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; describing the attributes of the applications of mindfulness; and describing the attributes of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas! [

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་ཡོན་ཏན་རྗོད་པ་དང་། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། སེམས་ཅན་རྣམས་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་གསུམ་ལ་འདུལ་བ་ནི་ངོ་མཚར་ཆེའོ།
en: How wonderful it is that] through skillful means they instruct beings in the three vehicles, namely, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the buddhas!”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོངས་སུ་བཟུང་ན། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བར་འགྱུར་བ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་པར་འགྱུར་བ་ངོ་མཚར་ཆེའོ།
en: Then Śakra, mighty lord of the gods, again addressed the Blessed One: “Blessed Lord, how wonderful it is that when this perfection of wisdom has been acquired, all the six perfections will be acquired, and that all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, will be acquired!”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་བཟུང་བས། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་།
en: The Blessed One replied to Śakra, mighty lord of the gods, “Kauśika, it is so!

source: འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: It is so!

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་བ་དང་།
en: By acquiring the perfection of wisdom, all the six perfections will be acquired, and all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, will be acquired. {

source: ཡོངས་སུ་བཟུང་བ་དང་།
en: Ki.

source: བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཚེ་འདི་ལ་ཡོན་ཏན་གང་དང་གང་ཡོངས་སུ་ཟིན་པར་འགྱུར་བ་དེ་དག་བསྟན་གྱིས།
en: II-III: 42} “Moreover, Kauśika, when they affirm, take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, the noble sons or noble daughters will acquire whichever attributes [are appropriate] in this lifetime.

source: ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་གྱིས་ཤིག །
en: I will reveal them! Listen well and keep it in mind!”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བགྱིའོ་ཞེས་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཉན་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་མུ་སྟེགས་ཅན་གཞན་དང་མུ་སྟེགས་སྤྱོད་པ་དང་། ཀུན་དུ་རྒྱུ་བ་དང་བདུད་དམ་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་འམ། གང་ཟག་ང་རྒྱལ་ཅན་ལ་ལ་ཞིག །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྒལ་བར་འདོད་པ་དང་། འདི་དང་དབྲལ་བར་འདོད་པ་དང་། འདི་ལ་
en: Śakra, mighty lord of the gods, replied, “Blessed Lord, so be it!”

source: བརྩད་པར་འདོད་པ་དང་། དགལ་བར་འདོད་པ་ཞིག་བྱུང་ན། བརྒལ་བར་འདོད་པ་དང་། དབྲལ་བར་འདོད་པ་དང་། བརྩད་པར་འདོད་པ་དང་། དགལ་བར་འདོད་པ་དེ་དག་གིས་བརྒལ་བ་དང་།
en: and he listened again to the Blessed One.

source: དབྲལ་བར་འདོད་པ་དང་། བརྩད་པར་འདོད་པ་དང་། དགལ་བར་འདོད་པ་དེ་དག་གི་རྒོལ་བ་དང་དབྲལ་བར་བྱ་བ་དང་། བརྩད་པ་དང་། དགལ་བར་བྱེད་པ་གང་དང་གང་བྱུང་བ་ཀུན་ཀྱང་མྱུར་དུ་ནུབ་ཅིང་མེད་པར་གྱུར་ཏེ། བརྒལ་བར་དགའ་བ་དང་།
en: The Blessed One then spoke as follows: “Kauśika, if there are any rival tīrthikas, followers of tīrthika practices, wandering mendicants, māras, gods included among the class of māras, or proud individuals who wish to dispute this perfection of wisdom, who wish to be separate from it, who wish to quarrel with it, or who wish to contradict it, all the disputations, separations, quarrels, and contradictions raised by those who wish to dispute, separate from, quarrel with, and contradict it will swiftly subside and become nonexistent.

source: དབྲལ་བར་དགའ་བ་དང་། བརྩད་པར་དགའ་བ་དང་། དགལ་བར་དགའ་བ་དེ་དག་གི་བསམ་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The intentions of those who delight in disputation, those who delight in separation, those who delight in quarreling, and those who delight in contradiction will not be fulfilled.

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡུན་རིང་པོར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། གང་གི་དོན་དུ་སེམས་ཅན་རྣམས་ཡུན་རིང་པོར་འཐབ་པ་དང་། རྩོད་པ་དང་། འཁྲུག་པ་དང་། ཤགས་སུ་གྱུར་པའི་ཕྱི་ནང་གི་ཆོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: If you ask why, Kauśika, it is because when bodhisattva great beings practice the six perfections over a long period of time, they will have forsaken those outer and inner phenomena for the sake of which beings have for so long fought, quarreled, raged, and contended.

source: སེམས་ཅན་དེ་དག་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པའི་ཕྱིར་རོ།
en: Therefore, they establish those beings in the perfection of generosity.

source: །གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་ཡུན་རིང་པོར་ཚུལ་ཁྲིམས་ངན་པར་འགྱུར་བའི་ཕྱི་ནང་གི་ཆོས་དེ་དག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: Bodhisattva great beings will have forsaken those outer and inner phenomena for the sake of which beings have for so long resorted to immorality.

source: སེམས་ཅན་དེ་དག་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པའི་ཕྱིར་རོ།
en: Therefore, they establish those beings in the perfection of ethical discipline.

source: །གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་ཡུན་རིང་པོར་ཁྲོ་བ་དང་། གནོད་སེམས་དང་། འཚེ་བར་གྱུར་བའི་ཕྱི་ནང་གི་ཆོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: Bodhisattva great beings will have forsaken those outer and inner phenomena for the sake of which beings have for so long resorted to anger, malice, and harmfulness.

source: སེམས་ཅན་དེ་དག་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པའི་ཕྱིར་རོ།
en: Therefore, they establish those beings in the perfection of tolerance.

source: །གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་ཡུན་རིང་པོར་ལེ་ལོ་བྱེད་པར་གྱུར་པའི་ཕྱི་ནང་གི་ཆོས་དེ་དག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: Bodhisattva great beings will have forsaken those outer and inner phenomena for the sake of which beings have for so long resorted to indolence.

source: སེམས་ཅན་དེ་དག་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པའི་ཕྱིར་རོ།
en: Therefore, they establish those beings in the perfection of perseverance.

source: །གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་ཡུན་རིང་པོར་སེམས་གཡེངས་པར་གྱུར་པའི་ཕྱི་ནང་གི་ཆོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: Bodhisattva great beings will have forsaken those outer and inner phenomena for the sake of which beings resort to distraction for a long time.

source: སེམས་ཅན་དེ་དག་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པའི་ཕྱིར་རོ།
en: Therefore, they establish those beings in the perfection of meditative concentration.

source: །གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་ཡུན་རིང་པོར་ཤེས་རབ་འཆལ་པར་གྱུར་པའི་ཕྱི་ནང་གི་ཆོས་དེ་དག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་བཏང་སྟེ།
en: Bodhisattva great beings will have forsaken those outer and inner phenomena for the sake of which beings have for so long resorted to stupidity.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རབ་ཏུ་བཀོད་པ་དང་། ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་རོ། །ཀཽ་ཤི་ཀ་གང་གི་དོན་དུ་སེམས་ཅན་དེ་དག་འདི་ལྟ་སྟེ།
en: Therefore, they establish those beings in the perfection of wisdom. “

source: བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བས་འཁོར་བ་ན་འཁོར་བར་གྱུར་བའི་བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པར་བཅིལ་ཏེ། སེམས་ཅན་དེ་དག་བསམ་གཏན་བཞི་ལ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་རོ།
en: Kauśika, bodhisattva great beings will have eliminated those latent impulses and obsessions for the sake of which beings wander in cyclic existence. {

source: །ཚད་མེད་པ་བཞི་དང་།
en: Ki.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། དྲན་པ་ཉེ་པར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: II-III: 43} Therefore they genuinely exhort beings toward the four meditative concentrations.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་རོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: Therefore, they genuinely exhort them toward the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the four applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: ལན་ཅིག་ཕྱིར་འོང་པའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་རོ།
en: Therefore, they genuinely exhort them toward the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment. “

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། དེ་ལ་ཡོན་ཏན་དེ་དག་འབྱུང་སྟེ།
en: Kauśika, when bodhisattva great beings practice the conduct of a bodhisattva in that manner, those attributes will emerge within them.

source: ཚེ་རབས་གཞན་ལ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ།
en: In other lives, too, they will attain manifest buddhahood in unsurpassed, complete enlightenment, and then turn the wheel of the Dharma.

source: སེམས་ཅན་རྣམས། སྨོན་ལམ་གྱི་ཚུལ་བཞིན་དུ་རབ་ཏུ་བཀོད་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཏེ། ཀཽ་ཤི་ཀ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚེ་རབས་གཞན་ལ་འབྱུང་བའི་ཡོན་ཏན་དང་། ལེགས་པ་དག་གོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་སའི་ཕྱོགས་གང་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ཡོད་པའི་སའི་ཕྱོགས་དེར་བདུད་དམ།
en: Having established beings in accordance with their aspirations, they will then attain final nirvāṇa, in the expanse of nirvāṇa where the psycho-physical aggregates are not left behind. “

source: བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་འམ། མུ་སྟེགས་ཅན་གཞན་དང་ཀུན་དུ་རྒྱུ་བའམ། གང་ཟག་ང་རྒྱལ་ཅན་རྣམས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སེམས་གཡེང་བར་བྱ་བ་འམ། རྒལ་བའམ། བརྩད་པའམ།
en: Moreover, Kauśika, in the vicinity of places where noble sons or noble daughters take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, no māras, or gods included among the māras, or rival tīrthikas, or wandering mendicants, or proud individuals will be able to intrude to distract their minds from this perfection of wisdom, or to dispute it, quarrel with it, contradict it, or negate it.

source: འགལ་བའམ། མེད་པར་བྱ་བའི་ཕྱིར་འོང་བར་མི་ནུས་ཏེ་དེའི་གོང་དུ་དེ་དག་ལ་ཡོན་ཏན་དང་ལེགས་པར་འགྱུར་བ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མཉན་པ་དང་གཟུང་བ་དང་བསྒོམ་པ་དང་། ཐེག་པ་གསུམ་གྱིས་བྱུང་ནས། སྡུག་བསྔལ་མཐར་འབྱིན་པར་འགྱུར་རོ།
en: In addition to that, there will be [other] attributes and advantages, in that those [māras and so forth] will listen to, take up, and cultivate this perfection of wisdom, and after being emancipated through the three vehicles, they will put an end to suffering. “

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། རྩི་མ་གྷི་ཞེས་བྱ་བ་དུག་ཐམས་ཅད་ཞི་བར་བྱེད་པ་ཡོད་དེ།
en: Kauśika, there is an herb called maghī that alleviates all poisons.

source: དེར་སྦྲུལ་ལམ་སྲོག་ཆགས་བཀྲེས་པས་མནར་ཅིང་། ཟས་ཚོལ་བ་ཞིག་གིས་སྲོག་ཆགས་ཀྱི་རིགས་ལ་ལ་མཐོང་བར་གྱུར་ཏེ། དེས་སྲོག་ཆགས་ཀྱི་རིགས་དེ་བཟའ་བའི་ཕྱིར། དེའི་རྗེས་སུ་འབྲངས་ཏེ་བསྙགས་པར་གྱུར་ན། དེ་ནས་སྲོག་ཆགས་ཀྱི་རིགས་དེ་འཆི་བས་འཇིགས་ཤིང་སྐྲག་སྟེ།
en: As an analogy, if a snake or creature famished by hunger, wanting to eat, were to see another creature, and in order to eat that creature pursue it, and if that other creature, while being pursued, in fear of death and in terror, were to go to a place where the herb maghī is growing, then that snake would turn back simply on smelling the herb. {

source: རྩི་མགྷི་གང་ན་ཡོད་པ་དེར་སོང་ན།
en: Ki.

source: དེ་ནས་སྦྲུལ་དེ་རྩི་དེའི་དྲི་ཚོར་བ་ཙམ་གྱིས་ཕྱིར་ལྡོག་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ལྟར་སྦྲུལ་གྱི་གདུག་པ་ཟིལ་གྱིས་གནོན་པ་དེ་ནི་རྩི་མ་གྷིའི་རྩིའི་ཡོན་ཏན་ཏེ།
en: II-III: 44} If you ask why, Kauśika, it is because the herbal attributes of maghī would overpower the venom of the snake.

source: ཀཽ་ཤི་ཀ་རྩི་མགྷི་དེ་ནི་དེ་ལྟ་བུའི་མཐུ་དང་ལྡན་ནོ།
en: Kauśika, such is the potency of the herb maghī.

source: །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ལ་ནི། ཀཽ་ཤི་ཀ་རྒོལ་བ་དང་རྩོད་པ་དང་། འགལ་བར་བྱེད་པ་གང་དང་གང་བྱུང་བ་དེ་དག་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟི་བརྗིད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཐུས་དེ་དག་ཉེ་བར་ཞི་བ་དང་མེད་པར་འགྱུར་ཏེ།
en: Similarly, Kauśika, those who would dispute, quarrel with, or contradict any noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom would all be pacified and eliminated by the brilliance of the perfection of wisdom and by the power of the perfection of wisdom.

source: གང་དང་གང་ནས་བྱུང་བ་དེ་དང་དེ་ཉིད་དུ་མེད་པར་འགྱུར་ཞིང་རྣམ་པར་འཕེལ་བར་མི་འགྱུར་རོ།
en: Wherever they appear, they would be eliminated in that very place and they would not prosper.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱེད་པ་སྟེ། རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ།
en: If you ask why, Kauśika, it is because the perfection of wisdom pacifies all negative and nonvirtuous phenomena, and does not allow them to prosper. “

source: །སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་གང་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱེད་ཅིང་རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཉེ་བར་ཞི་བར་བྱེད་དེ་རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ། །མ་རིག་པ་དང་འདུ་བྱེད་དང་།
en: If you ask what constitutes all the negative and nonvirtuous phenomena that the perfection of wisdom pacifies and does not allow to prosper, it is the case that it pacifies and does not allow desire, hatred, or delusion to prosper.

source: རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དང་། སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཤིག་གི་བར་དུ་ཉེ་བར་ཞི་བར་བྱེད་དེ། རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ། །བར་དུ་གཅོད་པ་དང་། སྒྲིབ་པ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བ་དང་། བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོར་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། ཡོད་པར་ལྟ་བ་དང་། མེད་པར་ལྟ་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་དང་། སེར་སྣ་དང་ཚུལ་ཁྲིམས་ངན་པ་དང་། གནོད་སེམས་དང་། ལེ་ལོ་དང་འཁྲུག་པ་དང་། ཤེས་རབ་འཆལ་པ་དང་། རྟག་པར་འདུ་ཤེས་པ་དང་། བདེ་བར་འདུ་ཤེས་པ་དང་། བདག་དུ་འདུ་ཤེས་པ་དང་། སྡུག་པར་འདུ་ཤེས་པ་དང་། སྲེད་པས་སྲེད་པའི་རྣམ་པར་སྤྱོད་པ་དང་། གཟུགས་སུ་འཛིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་འཛིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་འཛིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་འཛིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དུ་འཛིན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འཛིན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པར་འཛིན་པ་དང་། ཡང་དག་པར་སྤོང་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པར་འཛིན་པ་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་།
en: It pacifies ignorance, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, aging, death, sorrow, lamentation, suffering, discomfort, and agitation, up to and including the entire conglomerate of sufferings, and does not allow them to prosper. “

source: ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པར་འཛིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཛིན་པ་ཉེ་བར་ཞི་བར་བྱེད་དེ།
en: It pacifies obstacles; obscurations; latent impulses; obsessions; views of self and views of sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, and viewers; views of nihilism, views of eternalism, views of existence, and views of nonexistence; all aspects of wrong view; miserliness, immorality, malice, indolence, agitation, and stupidity; the notion of permanence, the notion of happiness, the notion of self, and the notion that existence is pleasant; the indulgence in craving due to craving; the grasping after physical forms; the grasping after feelings, perceptions, formative predispositions, and consciousness; the grasping after the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; the grasping after the emptiness of internal phenomena; the grasping after [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; the grasping after the applications of mindfulness; and the grasping after the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, and it does not allow [those graspings] to prosper.

source: རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ། །མྱ་ངན་ལས་འདས་པར་འཛིན་པ་ཉེ་བར་ཞི་བར་བྱེད་དེ།
en: It pacifies the grasping after nirvāṇa and does not allow it to prosper.

source: རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད་པ་ཡིན་ཏེ། རྣམ་པར་འཕེལ་བར་བྱེད་པ་མ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་།
en: Kauśika, this perfection of wisdom pacifies all those negative and nonvirtuous phenomena, and does not allow them to prosper. {

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་།
en: Ki.

source: འོག་མིན་གྱི་ལྷའི་བར་དེ་དག་ཐམས་ཅད་ཀྱང་། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ལ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་པ་དང་། བསྐྱབ་པ་དང་། བསྐྱང་པར་བྱེད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: II-III: 45} “Kauśika, the Four Great Kings in the great trichiliocosm, and Śakra, the mighty lord of the gods, and Brahmā, the lord of the world of Patient Endurance, and all the gods, up to and including those of Akaniṣṭha, will indeed always guard, shelter, and nurture without interruption those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom. “
